; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal_1cpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal_1bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~runtime_1internal_1atomic\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22math\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "./getSign.go", directory: "/workspace")
!5 = !{!6, !19, !21, !23, !25, !27}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "", directory: "")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !8, size: 128, align: 8, elements: !10)
!10 = !{!11, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !8, line: 1, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !8, line: 1, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, align: 8, elements: !17)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "void")
!17 = !{!18}
!18 = !DISubrange(count: 1, lowerBound: 0)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !8, type: !9, isLocal: false, isDefinition: true)
!29 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !30, line: 1, type: !31, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!30 = !DIFile(filename: "getSign.go", directory: ".")
!31 = !DISubroutineType(types: !32)
!32 = !{!16}
!33 = !{}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !29, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.getSign", scope: null, file: !30, line: 3, type: !38, scopeLine: 3, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!38 = !DISubroutineType(types: !39)
!39 = !{!12, !12}
!40 = !DILocalVariable(name: "x", arg: 1, scope: !37, file: !30, line: 3, type: !12)
!41 = !DILocation(line: 3, column: 14, scope: !37)
!42 = !DILocalVariable(name: "$ret0", scope: !37, file: !30, line: 3, type: !12)
!43 = !DILocation(line: 3, column: 21, scope: !37)
!44 = !DILocation(line: 4, column: 8, scope: !37)
!45 = !DILocation(line: 4, column: 10, scope: !37)
!46 = !DILocation(line: 4, column: 5, scope: !37)
!47 = !DILocation(line: 5, column: 9, scope: !37)
!48 = !DILocation(line: 7, column: 8, scope: !37)
!49 = !DILocation(line: 7, column: 10, scope: !37)
!50 = !DILocation(line: 7, column: 5, scope: !37)
!51 = !DILocation(line: 8, column: 9, scope: !37)
!52 = !DILocation(line: 10, column: 9, scope: !37)
!53 = distinct !DISubprogram(name: "main.main", scope: null, file: !54, line: 3, type: !31, scopeLine: 3, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!54 = !DIFile(filename: "main.go", directory: ".")
!55 = !DILocalVariable(name: "a", scope: !56, file: !54, line: 4, type: !12)
!56 = distinct !DILexicalBlock(scope: !53, file: !54, line: 3, column: 1)
!57 = !DILocation(line: 4, column: 9, scope: !53)
!58 = !DILocation(line: 5, column: 13, scope: !56)
!59 = !DILocation(line: 5, column: 5, scope: !56)
!60 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pop..stub", scope: null, file: !30, line: 1, type: !61, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !448, !448}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !30, line: 1, size: 19456, align: 8, elements: !65)
!65 = !{!66, !129, !142, !268, !269, !270, !271, !272, !273, !274, !275, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !302, !303, !304, !305, !306, !321, !322, !390, !391, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !425, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !30, line: 1, size: 256, align: 8, elements: !69)
!69 = !{!70, !71, !125, !126, !127, !128}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !72, size: 128, align: 64, offset: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !8, size: 128, align: 8, elements: !73)
!73 = !{!74, !124}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !77)
!77 = !{!78, !80, !81, !83, !85, !86, !87, !88, !97, !99, !105, !123}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !79, size: 64, align: 64)
!79 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !79, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !82, size: 32, align: 32, offset: 128)
!82 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !84, size: 8, align: 8, offset: 160)
!84 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !84, size: 8, align: 8, offset: 168)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !84, size: 8, align: 8, offset: 176)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !84, size: 8, align: 8, offset: 184)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !15, !15}
!96 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !98, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !100, size: 64, align: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !98, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !106, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !100, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !100, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !112, size: 192, align: 64, offset: 128)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !8, size: 192, align: 8, elements: !113)
!113 = !{!114, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !117)
!117 = !{!109, !110, !118, !119, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !12, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 200)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 208)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 216)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !30, line: 1, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !30, line: 1, size: 512, align: 8, elements: !132)
!132 = !{!70, !133, !135, !136, !137, !138, !139, !140, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !30, line: 1, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !30, line: 1, baseType: !67, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !30, line: 1, baseType: !67, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 456)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !30, line: 1, baseType: !143, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !30, line: 1, size: 17280, align: 8, elements: !145)
!145 = !{!146, !147, !149, !150, !157, !163, !164, !166, !168, !169, !170, !172, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !185, !186, !187, !191, !192, !193, !194, !195, !196, !200, !201, !203, !204, !214, !215, !216, !217, !222, !223, !224, !225, !226, !227, !228, !245, !246, !247, !249, !253, !254, !263, !264, !265, !266, !267}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !30, line: 1, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !30, line: 1, baseType: !151, size: 1024, align: 64, offset: 192)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !30, line: 1, size: 1024, align: 8, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !30, line: 1, baseType: !154, size: 1024, align: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1024, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 16, lowerBound: 0)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !30, line: 1, baseType: !158, size: 64, align: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 1344)
!165 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 1408)
!167 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 1600)
!171 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !30, line: 1, baseType: !173, size: 32, align: 32, offset: 1664)
!173 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !30, line: 1, baseType: !173, size: 32, align: 32, offset: 1696)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !30, line: 1, baseType: !101, size: 128, align: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !30, line: 1, baseType: !173, size: 32, align: 32, offset: 1856)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !30, line: 1, baseType: !173, size: 32, align: 32, offset: 1888)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !30, line: 1, baseType: !173, size: 32, align: 32, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !30, line: 1, baseType: !173, size: 32, align: 32, offset: 1952)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 1992)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 2000)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !30, line: 1, baseType: !184, size: 8, align: 8, offset: 2008)
!184 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 2016)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !30, line: 1, baseType: !188, size: 64, align: 32, offset: 2080)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, align: 4, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2, lowerBound: 0)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 2144)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !84, size: 8, align: 8, offset: 2152)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !30, line: 1, baseType: !148, size: 64, align: 64, offset: 2176)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !30, line: 1, baseType: !173, size: 32, align: 32, offset: 2240)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "doesPark", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 2272)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !30, line: 1, baseType: !197, size: 64, align: 64, offset: 2304)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !30, line: 1, size: 64, align: 8, elements: !198)
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !30, line: 1, baseType: !79, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2368)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 2432)
!202 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 2496)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !30, line: 1, baseType: !205, size: 12288, align: 64, offset: 2560)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 12288, align: 8, elements: !212)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !30, line: 1, size: 384, align: 8, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !30, line: 1, baseType: !79, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !30, line: 1, baseType: !101, size: 128, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !30, line: 1, baseType: !101, size: 128, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 320)
!212 = !{!213}
!213 = !DISubrange(count: 32, lowerBound: 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 14848)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 14880)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 14912)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !30, line: 1, baseType: !218, size: 64, align: 64, offset: 14976)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !220)
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !93, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15040)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !30, line: 1, baseType: !84, size: 8, align: 8, offset: 15104)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15168)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 15232)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 15264)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 15296)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mFixup", file: !30, line: 1, baseType: !229, size: 192, align: 64, offset: 15360)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.mutex,uint32,*__go_descriptor}", file: !8, size: 192, align: 8, elements: !230)
!230 = !{!231, !236, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !8, line: 1, baseType: !232, size: 64, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !30, line: 1, size: 64, align: 8, elements: !233)
!233 = !{!234, !199}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lockRankStruct", file: !30, line: 1, baseType: !235, align: 8)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.lockRankStruct", file: !30, line: 1, align: 1, elements: !33)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "used", file: !8, line: 1, baseType: !82, size: 32, align: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fn", file: !8, line: 1, baseType: !238, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!96, !96}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 15552)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 15584)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !30, line: 1, baseType: !248, align: 8, offset: 15616)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !30, line: 1, align: 1, elements: !33)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !30, line: 1, baseType: !250, size: 8, align: 8, offset: 15616)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !30, line: 1, size: 8, align: 1, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !30, line: 1, baseType: !84, size: 8, align: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeldLen", file: !30, line: 1, baseType: !12, size: 64, align: 64, offset: 15680)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "locksHeld", file: !30, line: 1, baseType: !255, size: 1280, align: 64, offset: 15744)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 1280, align: 8, elements: !261)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.heldLockInfo", file: !30, line: 1, size: 128, align: 8, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lockAddr", file: !30, line: 1, baseType: !79, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "rank", file: !30, line: 1, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIBasicType(name: ".runtime.lockRank", size: 64, encoding: DW_ATE_signed)
!261 = !{!262}
!262 = !DISubrange(count: 10, lowerBound: 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 17024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 17088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 17152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 17160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !30, line: 1, baseType: !197, size: 64, align: 64, offset: 17216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !30, line: 1, baseType: !276, size: 8, align: 8, offset: 640)
!276 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 648)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 656)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 672)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 680)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 688)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 696)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 712)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "parkingOnChan", file: !30, line: 1, baseType: !84, size: 8, align: 8, offset: 720)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !30, line: 1, baseType: !184, size: 8, align: 8, offset: 728)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 736)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 744)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "trackingSeq", file: !30, line: 1, baseType: !84, size: 8, align: 8, offset: 752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "runnableStamp", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 768)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "runnableTime", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 896)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !30, line: 1, baseType: !148, size: 64, align: 64, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !30, line: 1, baseType: !167, size: 64, align: 64, offset: 1024)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !30, line: 1, baseType: !202, size: 64, align: 64, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 1152)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !30, line: 1, baseType: !299, size: 192, align: 64, offset: 1216)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !8, size: 192, align: 8, elements: !300)
!300 = !{!301, !121, !122}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !98, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 1472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 1536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 1600)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !30, line: 1, baseType: !307, size: 64, align: 64, offset: 1664)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !8, size: 192, align: 8, elements: !309)
!309 = !{!310, !121, !122}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !30, line: 1, size: 320, align: 8, elements: !313)
!313 = !{!314, !319, !320}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !30, line: 1, baseType: !315, size: 192, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !8, size: 192, align: 8, elements: !316)
!316 = !{!317, !121, !122}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 1728)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !30, line: 1, baseType: !323, size: 64, align: 64, offset: 1792)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !30, line: 1, size: 704, align: 8, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "success", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 424)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !30, line: 1, baseType: !339, size: 64, align: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !30, line: 1, size: 768, align: 8, elements: !341)
!341 = !{!342, !344, !345, !346, !348, !349, !381, !382, !383, !388, !389}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !30, line: 1, baseType: !343, size: 64, align: 64)
!343 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !30, line: 1, baseType: !343, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !30, line: 1, baseType: !347, size: 16, align: 16, offset: 192)
!347 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 224)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !30, line: 1, baseType: !350, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !30, line: 1, size: 512, align: 8, elements: !352)
!352 = !{!353, !354, !355, !356, !358, !359, !360, !361, !362, !363, !364, !380}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !30, line: 1, baseType: !79, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !30, line: 1, baseType: !357, size: 8, align: 8, offset: 160)
!357 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !30, line: 1, baseType: !84, size: 8, align: 8, offset: 168)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !30, line: 1, baseType: !84, size: 8, align: 8, offset: 176)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !30, line: 1, baseType: !84, size: 8, align: 8, offset: 184)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !30, line: 1, baseType: !218, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !30, line: 1, baseType: !98, size: 64, align: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !30, line: 1, baseType: !100, size: 64, align: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !30, line: 1, baseType: !365, size: 64, align: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !30, line: 1, size: 320, align: 8, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !30, line: 1, baseType: !100, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !30, line: 1, baseType: !100, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !30, line: 1, baseType: !371, size: 192, align: 64, offset: 128)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !8, size: 192, align: 8, elements: !372)
!372 = !{!373, !121, !122}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !30, line: 1, size: 320, align: 8, elements: !376)
!376 = !{!368, !369, !377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !30, line: 1, baseType: !343, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !30, line: 1, baseType: !343, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !30, line: 1, baseType: !384, size: 128, align: 64, offset: 448)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !30, line: 1, size: 128, align: 8, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !30, line: 1, baseType: !15, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !30, line: 1, baseType: !384, size: 128, align: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !30, line: 1, baseType: !232, size: 64, align: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 1856)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !30, line: 1, baseType: !392, size: 64, align: 64, offset: 1920)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !30, line: 1, size: 576, align: 8, elements: !394)
!394 = !{!395, !396, !397, !398, !406, !407, !408, !409}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !30, line: 1, baseType: !167, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !30, line: 1, baseType: !399, size: 64, align: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!16, !72, !79}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !30, line: 1, baseType: !72, size: 128, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !30, line: 1, baseType: !82, size: 32, align: 32, offset: 1984)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !30, line: 1, baseType: !171, size: 64, align: 64, offset: 2048)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2112)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 2176)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 2240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 2304)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 2368)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 2432)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2496)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 2560)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !30, line: 1, baseType: !15, size: 64, align: 64, offset: 2624)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !30, line: 1, baseType: !422, size: 7808, align: 64, offset: 2688)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 7808, align: 8, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 122, lowerBound: 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !30, line: 1, baseType: !426, size: 64, align: 64, offset: 10496)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !30, line: 1, size: 64, align: 8, elements: !428)
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !30, line: 1, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!16, !15}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 10560)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 10624)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 10688)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 10696)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 10752)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 10816)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 10880)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 10888)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 10896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 10904)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !30, line: 1, baseType: !96, size: 8, align: 8, offset: 10912)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !30, line: 1, baseType: !79, size: 64, align: 64, offset: 10944)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !30, line: 1, baseType: !422, size: 7808, align: 64, offset: 11008)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !30, line: 1, baseType: !447, size: 640, align: 64, offset: 18816)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 640, align: 8, elements: !261)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !8, size: 128, align: 8, elements: !450)
!450 = !{!451, !455}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !8, line: 1, baseType: !452, size: 64, align: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !30, line: 1, size: 64, align: 8, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !30, line: 1, baseType: !165, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !8, line: 1, baseType: !173, size: 32, align: 32, offset: 64)
!456 = !DILocalVariable(name: "$this21", arg: 1, scope: !60, file: !30, line: 1, type: !448)
!457 = !DILocation(line: 1, column: 1, scope: !60)
!458 = !DILocalVariable(name: "$ret1", scope: !60, file: !30, line: 1, type: !63)
!459 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0pushAll..stub", scope: null, file: !30, line: 1, type: !460, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!460 = !DISubroutineType(types: !461)
!461 = !{!16, !448, !448, !462}
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !30, line: 1, size: 128, align: 8, elements: !463)
!463 = !{!454, !464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !30, line: 1, baseType: !165, size: 64, align: 64, offset: 64)
!465 = !DILocalVariable(name: "$this22", arg: 1, scope: !459, file: !30, line: 1, type: !448)
!466 = !DILocation(line: 1, column: 1, scope: !459)
!467 = !DILocalVariable(name: "$p23", arg: 2, scope: !459, file: !30, line: 1, type: !462)
!468 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0push..stub", scope: null, file: !30, line: 1, type: !469, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!469 = !DISubroutineType(types: !470)
!470 = !{!16, !448, !448, !63}
!471 = !DILocalVariable(name: "$this24", arg: 1, scope: !468, file: !30, line: 1, type: !448)
!472 = !DILocation(line: 1, column: 1, scope: !468)
!473 = !DILocalVariable(name: "$p25", arg: 2, scope: !468, file: !30, line: 1, type: !63)
!474 = distinct !DISubprogram(name: "g.struct_4runtime_0gList_cruntime_0n_bint32_5.runtime_0empty..stub", scope: null, file: !30, line: 1, type: !475, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !33)
!475 = !DISubroutineType(types: !476)
!476 = !{!96, !448, !448}
!477 = !DILocalVariable(name: "$this26", arg: 1, scope: !474, file: !30, line: 1, type: !448)
!478 = !DILocation(line: 1, column: 1, scope: !474)
!479 = !DILocalVariable(name: "$ret2", scope: !474, file: !30, line: 1, type: !96)
!480 = distinct !DISubprogram(name: "main.struct_4runtime_0gList_cruntime_0n_bint32_5..eq", scope: null, file: !36, line: 1, type: !94, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!481 = !DILocalVariable(name: "key1", arg: 1, scope: !480, file: !36, line: 1, type: !15)
!482 = !DILocation(line: 1, column: 1, scope: !480)
!483 = !DILocalVariable(name: "key2", arg: 2, scope: !480, file: !36, line: 1, type: !15)
!484 = !DILocalVariable(name: "$ret3", scope: !480, file: !36, line: 1, type: !96)
!485 = distinct !DISubprogram(name: "main._632_7uintptr..eq", scope: null, file: !36, line: 1, type: !94, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!486 = !DILocalVariable(name: "key1", arg: 1, scope: !485, file: !36, line: 1, type: !15)
!487 = !DILocation(line: 1, column: 1, scope: !485)
!488 = !DILocalVariable(name: "key2", arg: 2, scope: !485, file: !36, line: 1, type: !15)
!489 = !DILocalVariable(name: "$ret4", scope: !485, file: !36, line: 1, type: !96)
!490 = distinct !DISubprogram(name: "main._6256_7uint64..eq", scope: null, file: !36, line: 1, type: !94, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!491 = !DILocalVariable(name: "key1", arg: 1, scope: !490, file: !36, line: 1, type: !15)
!492 = !DILocation(line: 1, column: 1, scope: !490)
!493 = !DILocalVariable(name: "key2", arg: 2, scope: !490, file: !36, line: 1, type: !15)
!494 = !DILocalVariable(name: "$ret5", scope: !490, file: !36, line: 1, type: !96)
!495 = distinct !DISubprogram(name: "main._661_7struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !94, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!496 = !DILocalVariable(name: "key1", arg: 1, scope: !495, file: !36, line: 1, type: !15)
!497 = !DILocation(line: 1, column: 1, scope: !495)
!498 = !DILocalVariable(name: "key2", arg: 2, scope: !495, file: !36, line: 1, type: !15)
!499 = !DILocalVariable(name: "$ret6", scope: !495, file: !36, line: 1, type: !96)
!500 = distinct !DISubprogram(name: "main.struct_4Size_buint32_cMallocs_buint64_cFrees_buint64_5..eq", scope: null, file: !36, line: 1, type: !94, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !33)
!501 = !DILocalVariable(name: "key1", arg: 1, scope: !500, file: !36, line: 1, type: !15)
!502 = !DILocation(line: 1, column: 1, scope: !500)
!503 = !DILocalVariable(name: "key2", arg: 2, scope: !500, file: !36, line: 1, type: !15)
